# -*- coding: utf-8 -*-

# LangPack for OpenConsole
# By Wico

welcome1 = "OpenConsole [Версія 1.0]\n(c) Wico | Усе правы абаронены."
welcome2 = "Вы ўвайшлі як: "
openexplorer1 = "OpenExplorer - Правадыр\n1) Стварэнне новай дырэкторыі\n2) Чытанне існуючай дырэкторыі\n3) Чытанне існуючага файла"
openexplorer2 = "Напішыце патрэбную лічбу -->"
readfile1 = "\n[ReadFile] Увядзіце назву файла з яго пашырэннем --> "
readfile2 = "\n[ReadFile] Вы не ўказалі назву файла!\n"
readfile3 = "\n[ReadFile] Файла не існуе!\n"
readdir1 = "\n[ListDir] Увядзіце назву дырэкторыі --> "
readdir2 = "\n[ListDir] Вы не ўказалі назву дырэкторыі!\n"
readdir3 = "\n[ListDir] Дырэкторыі не існуе!\n"
mkdir1 = "\n[MkDir] Увядзіце назву новай дырэкторыі --> "
mkdir2 = "\n[MkDir] Паспяхова створана новая дырэкторыя 'Folder'\n"
mkdir3 = "\n[MkDir] Паспяхова створана новая дырэкторыя"
mkdir4 = "\n[MkDir] Дырэкторыя ўжо існуе!\n"
title1 = "\n[Title] Увядзіце новую назву акна --> "
echo1 = "\n[Echo] Увядзіце тэкст, які трэба вывесці --> "
color1 = "\nКастомныя колеры вываду тэксту\n1 - Зялёны\n2 - Чырвоны\n3 - Жоўты\n4 - Сіні\n5 - Скінуць кастамны колер"
color2 = "\nНапішыце патрэбную лічбу --> "
color3 = "\n[Colors] Паспяхова ўсталяваны колер 'Зялёны'\n"
color4 = "\n[Colors] Паспяхова ўсталяваны колер 'Чырвоны'\n"
color5 = "\n[Colors] Паспяхова ўсталяваны колер 'Жоўты'\n"
color6 = "\n[Colors] Паспяхова ўсталяваны колер 'Сіні'\n"
color7 = "\n[Colors] Паспяхова скінуты ўсе ўсталяваныя колеры\n"
color8 = "\n[Colors] Вы не ўказалі лічбу ці паказалі яе няправільна\n"
create_error1 = "[CreateError] Увядзіце тэкст памылкі --> "
create_error2 = "[CreateError] Увядзіце загаловак памылкі --> "
create_error3 = "[CreateError] Вы не ўказалі тэкст памылкі!"
create_error4 = "[CreateError] Вы не ўказалі загаловак памылкі!"
create_error5 = "[CreateError] Стварэнне памылкі. . ."
warning1 = "\nУвага, ваша аперацыйная сістэма не падтрымліваецца!\nКалі ласка, не паведамляйце пра ўсё не звычайнае..."
warning2 = "\nНацісніце Enter, каб працягваць"
error2 = "Памылка -> Файл канфігурацыі сапсаваны ці адсутнічае!"
error3 = "Памылка -> Сістэма не падтрымліваецца!"

debug1 = "[Наладка] OpenConsole запусціўся за {} секунд."

ball1 = "\nУвядзіце сваё пытанне --> "
ball2 = "\nАдказ шара --> {}"

results = [
    'Так.',
    'Не...',
    'Нават не думай!',
    'Мой адказ - не!',
    'Спытай яшчэ раз?'
]