# -*- coding: utf-8 -*-

# LangPack для OpenConsole
# By Wico

welcome1 = "OpenConsole [Версія 1.0]\n(c) Wico | Всі права захищені."
welcome2 = "Ви увійшли як:"
openexplorer1 = "OpenExplorer - Провідник\n1) Створення нової директорії\n2) Читання існуючої директорії\n3) Читання існуючого файлу"
openexplorer2 = "Напишіть потрібну цифру -->"
readfile1 = "\n[ReadFile] Введіть назву файлу з його розширенням --> "
readfile2 = "\n[ReadFile] Ви не вказали назву файлу!\n"
readfile3 = "\n[ReadFile] Файлу не існує!\n"
readdir1 = "\n[ListDir] Введіть назву директорії --> "
readdir2 = "\n[ListDir] Ви не вказали назву директорії!\n"
readdir3 = "\n[ListDir] Директорії не існує!\n"
mkdir1 = "\n[MkDir] Введіть назву нової директорії --> "
mkdir2 = "\n[MkDir] Успішно створено нову директорію 'Folder'\n"
mkdir3 = "\n[MkDir] Успішно створено нову директорію"
mkdir4 = "\n[MkDir] Директорія вже існує!\n"
title1 = "\n[Title] Введіть нову назву вікна --> "
echo1 = "\n[Echo] Введіть текст, який потрібно вивести --> "
color1 = "\nКастомні кольори виведення тексту\n1 - Зелений\n2 - Червоний\n3 - Жовтий\n4 - Синій\n5 - Скинути кастомний колір"
color2 = "\nНапишіть потрібну цифру --> "
color3 = "\n[Colors] Успішно встановлено колір 'Зелений'\n"
color4 = "\n[Colors] Успішно встановлено колір 'Червоний'\n"
color5 = "\n[Colors] Успішно встановлено колір 'Жовтий'\n"
color6 = "\n[Colors] Успішно встановлено колір 'Синій'\n"
color7 = "\n[Colors] Успішно скинуто всі встановлені кольори\n"
color8 = "\n[Colors] Ви не вказали цифру або вказали її неправильно\n"
create_error1 = "[CreateError] Введіть текст помилки --> "
create_error2 = "[CreateError] Введіть заголовок помилки --> "
create_error3 = "[CreateError] Ви не вказали текст помилки!"
create_error4 = "[CreateError] Ви не вказали заголовок помилки!"
create_error5 = "[CreateError] Створення помилки. . ."
warning1 = "\nУвага, ваша операційна система не підтримується!\nБудь ласка, не повідомляйте про все незвичайне..."
warning2 = "\nНатисніть Enter, щоб продовжити"
error2 = "Помилка -> Файл конфігурації зіпсований або відсутній!"
error3 = "Помилка -> Система не підтримується!"

debug1 = "[Налагодження] OpenConsole запустився за {} секунд."

ball1 = "\nВведіть своє питання --> "
ball2 = "\nВідповідь кулі --> {}"

results = [
    'Так.',
    'Ні...',
    'Навіть не думай!',
    'Моя відповідь ні!',
    'Запитай ще раз?'
]